packages/seurvalencia/seurvalencia-0.0.5-py3-none-any.whl/seurvalencia/template/picking_send.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <CabeceraAutenticacion xmlns="http://seurvalencia.es/IC/SERVICE/">
      <Username>${username}</Username>
      <Password>${password}</Password>
    </CabeceraAutenticacion>
  </soap:Header>
  <soap:Body>
    <wsImprimirBultosECB xmlns="http://seurvalencia.es/IC/SERVICE/">
      <Envio>
            <Adn_ClaveAduanaDestino>${adn_aduana_destino}</Adn_ClaveAduanaDestino>
            <Adn_ClaveAduanaOrigen>${adn_aduana_origen}</Adn_ClaveAduanaOrigen>
            <Adn_TipoMercancia>${adn_tipo_mercancia}</Adn_TipoMercancia>
            <Adn_ValorDeclarado>${adn_valor_declarado}</Adn_ValorDeclarado>
            <B2C_CanalPreaviso1>${b2c_canal_preaviso1}</B2C_CanalPreaviso1>
            <B2C_CanalPreaviso2>${b2c_canal_preaviso2}</B2C_CanalPreaviso2>
            <B2C_CanalPreaviso3>${b2c_canal_preaviso3}</B2C_CanalPreaviso3>
            <B2C_DatosCanal1>${b2c_canal1}</B2C_DatosCanal1>
            <B2C_DatosCanal2>${b2c_canal2}</B2C_DatosCanal2>
            <B2C_DatosCanal3>${b2c_canal3}</B2C_DatosCanal3>
            <B2C_FechaPropuestaEntrega>${b2c_fecha_entrega}</B2C_FechaPropuestaEntrega>
            <B2C_TestLlegada>${b2c_test_llegada}</B2C_TestLlegada>
            <B2C_TestPreaviso>${b2c_test_preaviso}</B2C_TestPreaviso>
            <B2C_TestReparto>${b2c_test_reparto}</B2C_TestReparto>
            <B2C_TurnoReparto>${b2c_turno_reparto}</B2C_TurnoReparto>
            <Blt_Observaciones>${blt_observaciones}</Blt_Observaciones>
            <Blt_Referencia>${blt_referencia}</Blt_Referencia>
            <Cab_Producto>${cab_producto}</Cab_Producto>
            <Cab_Servicio>${cab_servicio}</Cab_Servicio>
            <Csg_AtencionDe>${csg_atencion_de}</Csg_AtencionDe>
            <Csg_CCC>${csg_ccc}</Csg_CCC>
            <Csg_CodigoPostal>${csg_codigo_postal}</Csg_CodigoPostal>
            <Csg_Escalera>${csg_escalera}</Csg_Escalera>
            <Csg_Nombre>${csg_nombre}</Csg_Nombre>
            <Csg_NombreVia>${csg_nombre_via}</Csg_NombreVia>
            <Csg_NumeroVia>${csg_numero_via}</Csg_NumeroVia>
            <Csg_Pais>${csg_pais}</Csg_Pais>
            <Csg_Piso>${csg_piso}</Csg_Piso>
            <Csg_Poblacion>${csg_poblacion}</Csg_Poblacion>
            <Csg_Puerta>${csg_puerta}</Csg_Puerta>
            <Csg_Telefono>${csg_telefono}</Csg_Telefono>
            <Csg_TipoNumeroVia>${csg_tipo_numero_via}</Csg_TipoNumeroVia>
            <Csg_TipoVia>${csg_tipo_via}</Csg_TipoVia>
            <Exp_Bultos>${exp_bultos}</Exp_Bultos>
            <Exp_Cambio>${exp_cambio}</Exp_Cambio>
            <Exp_ClaveCDE>${exp_cde}</Exp_ClaveCDE>
            <Exp_ClavePortes>${exp_portes}</Exp_ClavePortes>
            <Exp_ClaveReembolso>${exp_reembolso}</Exp_ClaveReembolso>
            <Exp_ClaveSeguro>${exp_seguro}</Exp_ClaveSeguro>
            <Exp_EntregarSabado>${exp_entregar_sabado}</Exp_EntregarSabado>
            <Exp_LC>${exp_lc}</Exp_LC>
            <Exp_Observaciones>${exp_observaciones}</Exp_Observaciones>
            <Exp_Peso>${exp_peso}</Exp_Peso>
            <Exp_Referencia>${exp_referencia}</Exp_Referencia>
            <Exp_ValorReembolso>${exp_valor_reembolso}</Exp_ValorReembolso>
            <Exp_ValorSeguro>${exp_valor_seguro}</Exp_ValorSeguro>
            <Fr_CentroLogistico>${fr_centro_logistico}</Fr_CentroLogistico>
            <Fr_ClaveAlmacenarHasta>${fr_almacenar_hasta}</Fr_ClaveAlmacenarHasta>
            <Fr_ClaveTipoEmbalaje>${fr_tipo_embalaje}</Fr_ClaveTipoEmbalaje>
            <Fr_FechaAlmacenarHasta>${fr_almacenar_hasta}</Fr_FechaAlmacenarHasta>
            <Fr_TestigoEntregaSabado>${fr_entrega_sabado}</Fr_TestigoEntregaSabado>
            <Fr_TipoEmbalaje>${fr_embalaje}</Fr_TipoEmbalaje>
            <Fr_TipoEtiquetaControl>${fr_etiqueta_control}</Fr_TipoEtiquetaControl>
            <GS_Codigo>${gs_codigo}</GS_Codigo>
            <GS_CodigoCentro>${gs_codigo_centro}</GS_CodigoCentro>
            <GS_CodigoDepartamento>${gs_codigo_departamento}</GS_CodigoDepartamento>
            <GS_ConsolidarPedido>${gs_consolidar_pedido}</GS_ConsolidarPedido>
            <GS_FechaPropuestaEntrega>${gs_fecha_entrega}</GS_FechaPropuestaEntrega>
            <GS_HoraDesde>${gs_hora_desde}</GS_HoraDesde>
            <GS_HoraHasta>${gs_hora_hasta}</GS_HoraHasta>
            <GS_NumeroPedido>${gs_numero_pedido}</GS_NumeroPedido>
            <GS_TestConsignatario>${gs_consignatario}</GS_TestConsignatario>
            <GS_TipoMercancia>${gs_tipo_mercancia}</GS_TipoMercancia>
            <Int_CodigoDivisa>${int_divisa}</Int_CodigoDivisa>
            <Int_CodigoFamiliaMercancia>${int_famimila_mercancia}</Int_CodigoFamiliaMercancia>
            <Int_CodigoProductoMercancia>${int_producto_mercancia}</Int_CodigoProductoMercancia>
            <Int_CsgCodigoPais>${int_codigo_pais}</Int_CsgCodigoPais>
            <Int_CsgCodigoPostal>${int_codigo_postal}</Int_CsgCodigoPostal>
            <Int_CsgContacto>${int_contracto}</Int_CsgContacto>
            <Int_CsgExtensionDireccion>${int_extension_direccion}</Int_CsgExtensionDireccion>
            <Int_CsgTelefono>${int_telefono}</Int_CsgTelefono>
            <Int_IBLCourier>${int_courier}</Int_IBLCourier>
            <Int_IdMercancia>${int_mercancia}</Int_IdMercancia>
            <Int_RteCodigoPais>${int_codigo_pais}</Int_RteCodigoPais>
            <Int_RteCodigoPostal>${int_codigo_postal}</Int_RteCodigoPostal>
            <Int_ValorDeclarado>${int_valor_declarado}</Int_ValorDeclarado>
      </Envio>
    </wsImprimirBultosECB>
  </soap:Body>
</soap:Envelope>
